komeed/pcb_sim_cpp/mcu/nrf52840/nrf52840_registers.h
/*
 *
 * GPIO
*/
#define NRF52840_NUM_GPIO 48
/* =========================================================================
 * Base Memory Map Defines
 * ========================================================================= */
#define NRF52840_GPIO_BASE            0x50000000
#define NRF52840_GPIO_P0_BASE         0x50000000
#define NRF52840_GPIO_P1_BASE         0x50000300
#define NRF52840_GPIO_PAGE_SIZE       0x1000

/* Relative Port Offsets */
#define NRF52840_P1_RELATIVE_OFFSET   0x300

/* =========================================================================
 * Relative Register Offsets (Standard for P0 or Normalized Port Operations)
 * ========================================================================= */
#define NRF52840_GPIO_OUT_OFFSET        0x504
#define NRF52840_GPIO_OUTSET_OFFSET     0x508
#define NRF52840_GPIO_OUTCLR_OFFSET     0x50C
#define NRF52840_GPIO_IN_OFFSET         0x510
#define NRF52840_GPIO_DIR_OFFSET        0x514
#define NRF52840_GPIO_DIRSET_OFFSET     0x518
#define NRF52840_GPIO_DIRCLR_OFFSET     0x51C
#define NRF52840_GPIO_LATCH_OFFSET      0x520
#define NRF52840_GPIO_DETECTMODE_OFFSET 0x524
#define NRF52840_GPIO_PIN_CNF_BASE      0x700

/* =========================================================================
 * Explicit Port 0 (P0) Absolute Offsets
 * ========================================================================= */
#define NRF52840_P0_OUT_OFFSET          (NRF52840_GPIO_OUT_OFFSET)
#define NRF52840_P0_OUTSET_OFFSET       (NRF52840_GPIO_OUTSET_OFFSET)
#define NRF52840_P0_OUTCLR_OFFSET       (NRF52840_GPIO_OUTCLR_OFFSET)
#define NRF52840_P0_IN_OFFSET           (NRF52840_GPIO_IN_OFFSET)
#define NRF52840_P0_DIR_OFFSET          (NRF52840_GPIO_DIR_OFFSET)
#define NRF52840_P0_DIRSET_OFFSET       (NRF52840_GPIO_DIRSET_OFFSET)
#define NRF52840_P0_DIRCLR_OFFSET       (NRF52840_GPIO_DIRCLR_OFFSET)
#define NRF52840_P0_LATCH_OFFSET        (NRF52840_GPIO_LATCH_OFFSET)
#define NRF52840_P0_DETECTMODE_OFFSET   (NRF52840_GPIO_DETECTMODE_OFFSET)
#define NRF52840_P0_PIN_CNF_BASE        (NRF52840_GPIO_PIN_CNF_BASE)

/* =========================================================================
 * Explicit Port 1 (P1) Absolute Offsets (Base Offset + 0x300)
 * ========================================================================= */
#define NRF52840_P1_OUT_OFFSET          (NRF52840_GPIO_OUT_OFFSET + NRF52840_P1_RELATIVE_OFFSET) // 0x804
#define NRF52840_P1_OUTSET_OFFSET       (NRF52840_GPIO_OUTSET_OFFSET + NRF52840_P1_RELATIVE_OFFSET) // 0x808
#define NRF52840_P1_OUTCLR_OFFSET       (NRF52840_GPIO_OUTCLR_OFFSET + NRF52840_P1_RELATIVE_OFFSET) // 0x80C
#define NRF52840_P1_IN_OFFSET           (NRF52840_GPIO_IN_OFFSET + NRF52840_P1_RELATIVE_OFFSET) // 0x810
#define NRF52840_P1_DIR_OFFSET          (NRF52840_GPIO_DIR_OFFSET + NRF52840_P1_RELATIVE_OFFSET) // 0x814
#define NRF52840_P1_DIRSET_OFFSET       (NRF52840_GPIO_DIRSET_OFFSET + NRF52840_P1_RELATIVE_OFFSET) // 0x818
#define NRF52840_P1_DIRCLR_OFFSET       (NRF52840_GPIO_DIRCLR_OFFSET + NRF52840_P1_RELATIVE_OFFSET) // 0x81C
#define NRF52840_P1_LATCH_OFFSET        (NRF52840_GPIO_LATCH_OFFSET + NRF52840_P1_RELATIVE_OFFSET) // 0x820
#define NRF52840_P1_DETECTMODE_OFFSET   (NRF52840_GPIO_DETECTMODE_OFFSET + NRF52840_P1_RELATIVE_OFFSET) // 0x824
#define NRF52840_P1_PIN_CNF_BASE        (NRF52840_GPIO_PIN_CNF_BASE + NRF52840_P1_RELATIVE_OFFSET) // 0xA00

/* =========================================================================
 *
 *
 * TIMER
 *
 *
 * ========================================================================= */

#define NRF52840_4CC_TIMER_BASE 0x40008000
#define NRF52840_4CC_INDIV_TIMER_PAGE 0x1000
#define NRF52840_4CC_TIMER_PAGE_SIZE 0x3000


#define NRF52840_TIMER0_BASE 0x40008000
#define NRF52840_TIMER1_BASE 0x40009000
#define NRF52840_TIMER2_BASE 0x4000A000
#define NRF52840_TIMER3_BASE 0x4001A000
#define NRF52840_TIMER4_BASE 0x4001B000

#define NRF52840_TIMER_TASKS_START_OFFSET       0x000
#define NRF52840_TIMER_TASKS_STOP_OFFSET        0x004
#define NRF52840_TIMER_TASKS_COUNT_OFFSET       0x008
#define NRF52840_TIMER_TASKS_CLEAR_OFFSET       0x00C
#define NRF52840_TIMER_TASKS_SHUTDOWN_OFFSET    0x010

#define NRF52840_TIMER_TASKS_CAPTURE_0_OFFSET   0x040
#define NRF52840_TIMER_TASKS_CAPTURE_1_OFFSET   0x044
#define NRF52840_TIMER_TASKS_CAPTURE_2_OFFSET   0x048
#define NRF52840_TIMER_TASKS_CAPTURE_3_OFFSET   0x04C
#define NRF52840_TIMER_TASKS_CAPTURE_4_OFFSET   0x050
#define NRF52840_TIMER_TASKS_CAPTURE_5_OFFSET   0x054

#define NRF52840_TIMER_EVENTS_COMPARE_0_OFFSET  0x140
#define NRF52840_TIMER_EVENTS_COMPARE_1_OFFSET  0x144
#define NRF52840_TIMER_EVENTS_COMPARE_2_OFFSET  0x148
#define NRF52840_TIMER_EVENTS_COMPARE_3_OFFSET  0x14C
#define NRF52840_TIMER_EVENTS_COMPARE_4_OFFSET  0x150
#define NRF52840_TIMER_EVENTS_COMPARE_5_OFFSET  0x154

#define NRF52840_TIMER_SHORTS_OFFSET             0x200

#define NRF52840_TIMER_INTENSET_OFFSET           0x304
#define NRF52840_TIMER_INTENCLR_OFFSET           0x308

#define NRF52840_TIMER_MODE_OFFSET               0x504
#define NRF52840_TIMER_BITMODE_OFFSET            0x508
#define NRF52840_TIMER_PRESCALER_OFFSET          0x510

#define NRF52840_TIMER_CC_0_OFFSET               0x540
#define NRF52840_TIMER_CC_1_OFFSET               0x544
#define NRF52840_TIMER_CC_2_OFFSET               0x548
#define NRF52840_TIMER_CC_3_OFFSET               0x54C
#define NRF52840_TIMER_CC_4_OFFSET               0x550
#define NRF52840_TIMER_CC_5_OFFSET               0x554